Билет17_ОУ_Доп2/Documents/РасходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РасходДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДолгиКоммитентам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Коммитенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коммитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет17_ОУ_Доп2/AccumulationRegisters/ДолгиКоммитентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ДолгиКоммитентам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Коммитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет17_ОУ_Доп2/Documents/РасходДенег/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ДолгиКоммитентам.Записывать = Истина;
	Для Каждого ТекСтрокаКоммитенты Из Коммитенты Цикл
		
		Движение = Движения.ДолгиКоммитентам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Коммитент = ТекСтрокаКоммитенты.Коммитент;
		Движение.Долг = ТекСтрокаКоммитенты.Сумма;
		
	КонецЦикла;

	ДВижения.ДолгиКоммитентам.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасходДенегКоммитенты.Коммитент КАК Коммитент
		|ПОМЕСТИТЬ ВТ_ДанныеДок
		|ИЗ
		|	Документ.РасходДенег.Коммитенты КАК РасходДенегКоммитенты
		|ГДЕ
		|	РасходДенегКоммитенты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДолгиКоммитентамОстатки.Коммитент КАК Коммитент,
		|	ДолгиКоммитентамОстатки.Коммитент.Представление КАК КоммитентПредставление,
		|	-ДолгиКоммитентамОстатки.ДолгОстаток КАК ДолгОстаток
		|ИЗ
		|	РегистрНакопления.ДолгиКоммитентам.Остатки(
		|			&Граница,
		|			Коммитент В
		|				(ВЫБРАТЬ
		|					ВТ_ДанныеДок.Коммитент КАК Коммитент
		|				ИЗ
		|					ВТ_ДанныеДок КАК ВТ_ДанныеДок)) КАК ДолгиКоммитентамОстатки
		|ГДЕ
		|	ДолгиКоммитентамОстатки.ДолгОстаток < 0";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Превышена сумма выплаты коммитенту %1 на %2", ВыборкаДетальныеЗаписи.КоммитентПредставление, ВыборкаДетальныеЗаписи.ДолгОстаток);
		Сообщение.Сообщить();
		
	КонецЦикла;
	
КонецПроцедуры
